{
    "projects": [
      {
        "name": "Fitpuls-MobileAPP",
        "description": "A fully functional e-commerce platform allowing users to browse, shop, and manage orders. Includes features like user authentication, payment integration, and an admin panel for managing inventory.",
        "responsible_members": [
          "Alice Johnson",
          "Bob Lee",
          "Emma Davis"
        ],
        "technologies": [
          "React",
          "Node.js",
          "Express",
          "MongoDB",
          "Stripe API"
        ],
        "reviews": [
          {
            "reviewer": "John Smith",
            "rating": 4.5,
            "comment": "The e-commerce platform is intuitive and easy to use. However, the checkout process could use some improvements in terms of UX."
          },
          {
            "reviewer": "Sarah White",
            "rating": 4.8,
            "comment": "Impressive work! The platform runs smoothly, and the payment gateway integration was seamless."
          }
        ]
      },
      {
        "name": "Mobile Banking App",
        "description": "A mobile application for secure banking transactions. Users can check balances, transfer money, pay bills, and receive notifications about account activities.",
        "responsible_members": [
          "James Brown",
          "Alice Johnson",
          "Emma Davis"
        ],
        "technologies": [
          "React Native",
          "Firebase",
          "Redux",
          "Stripe API",
          "Twilio"
        ],
        "reviews": [
          {
            "reviewer": "Michael King",
            "rating": 4.2,
            "comment": "The app is responsive and easy to navigate. I had some minor issues with notifications not coming through sometimes."
          },
          {
            "reviewer": "Rachel Green",
            "rating": 5.0,
            "comment": "The security features of this app are top-notch. I feel safe making transactions, and the design is modern and user-friendly."
          }
        ]
      },
      {
        "name": "Task Management Tool",
        "description": "A web-based task management tool for teams to collaborate on projects. It features task assignments, deadlines, progress tracking, and team communication through built-in chat.",
        "responsible_members": [
          "Bob Lee",
          "Emma Davis",
          "James Brown"
        ],
        "technologies": [
          "Angular",
          "Node.js",
          "Socket.IO",
          "MySQL"
        ],
        "reviews": [
          {
            "reviewer": "Tom Harris",
            "rating": 4.3,
            "comment": "Great tool for managing projects and tasks. The real-time chat feature is particularly useful, though the UI could be improved."
          },
          {
            "reviewer": "Laura White",
            "rating": 4.7,
            "comment": "The task tracking is very intuitive. It helped my team stay on track with deadlines. Would love to see a mobile version."
          }
        ]
      },
      {
        "name": "Social Media Analytics Dashboard",
        "description": "A web app for tracking social media engagement and providing detailed analytics on posts, followers, and interactions across platforms like Twitter, Facebook, and Instagram.",
        "responsible_members": [
          "Alice Johnson",
          "James Brown",
          "Sarah White"
        ],
        "technologies": [
          "Vue.js",
          "Django",
          "PostgreSQL",
          "Chart.js",
          "REST API"
        ],
        "reviews": [
          {
            "reviewer": "David Turner",
            "rating": 4.8,
            "comment": "The dashboard provides a great overview of our social media performance. The graphs and data visualizations are extremely helpful."
          },
          {
            "reviewer": "Nina Carter",
            "rating": 4.0,
            "comment": "It would be even better if it could integrate with more social media platforms. But overall, a great tool for analytics."
          }
        ]
      }
    ]
  }
  